const handler = async (m, { conn }) => {

    const imageUrl = "https://i.postimg.cc/X7H7f51p/IMG.jpg";

    const messageText = `
*『 مرحبا بك يا  ⌊ ${m.pushName} ⌉ في كوكب الأوامر العامة 』*
*⌝ جميع الأوامر ┋🌍⌞ ⇊*
*⌝ قسم البحث ┋🔍💀⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
📂 *.apk*  
🔎 *.جيتهاب*  
🔎 *.تابع-شغل*  
🎵 *.تيك3*  
📺 *.تيوبي*  
🎶 *.شغل*  
🔊 *.صو*  
🎤 *.صوت*  
🎧 *.صوتوي*  
🖼️ *.صوره*  
🎙️ *.فويس*  
📹 *.فيد*  
🎞️ *.فيديو*  
📽️ *.فيديوي*  
📝 *.كلمات*  
🎼 *.ملف-صوت*  
▶️ *.يوتيوب*  
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> 𝑬𝑺𝑪𝑨𝑵𝑶𝑹 𝑩𝑶𝑻💀
*⌝ قسم الفعاليات ┋🪄⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
*📝┊⇇『احزر』*
*📍┊⇇『علم』*
*🗃️┊⇇『عين』*
*⚽┊⇇『كوره』*
*📿┊⇇『دين』*
> هذا القسم قيد تطوير
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> إسِــــکْأّنِـوٌر بـــ𝑬𝑺𝑪𝑨𝑵𝑶𝑹ـــوت 💗💛
*⌝ قسم الترفيه ┋🎭⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
*👥┊⇇『اصحاب』*
*⚔️┊⇇『اعدام』*
*🏆┊⇇『توب』*
*🎭┊⇇『الشخصيه』*
*🗣️┊⇇『الصراحه』*
*⚽┊⇇『الكوره』*
*😈┊⇇『انحرافي』*
*🎸┊⇇『ايمو』*
*🐾┊⇇『بوستات』*
*📝┊⇇『بوست』*
*🚔┊⇇『بوليس』*
*💎┊⇇『بيبضني』*
*❤️┊⇇『بيحبني』*
*💔┊⇇『بيكرهني』*
*👑┊⇇『تاج』*
*💣┊⇇『تفجير』*
*🔠┊⇇『حروف』*
*🍀┊⇇『حظي』*
*🐏┊⇇『خروف』*
*💍┊⇇『خطوبه』*
*🧠┊⇇『ذكاء』*
*🦾┊⇇『رجولتي』*
*🧑‍🤝‍🧑┊⇇『رفيق』*
*🎭┊⇇『شخصيه』*
*🤝┊⇇『صديق』*
*🎤┊⇇『صراحتي』*
*💔┊⇇『طلاق』*
*💞┊⇇『علاقه』*
*❓┊⇇『فزوره』*
*🎥┊⇇『فيلم』*
*🔪┊⇇『قتل』*
*🐱┊⇇『قطه』*
*📖┊⇇『مقولات』*
*🎲┊⇇『نرد』*
*📊┊⇇『نوعيه』*
*🔍┊⇇『هذا』*
*❔┊⇇『هل』*
*⚰️┊⇇『وفاتي』*
> هذا القسم قيد تطوير
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> إسِــــکْأّنِـوٌر بـــ𝑬𝑺𝑪𝑨𝑵𝑶𝑹ـــوت 💗💛
*⌝ قسم التحميلات ┋📥⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
*📝┊⇇『بين-فيديو』*
*📍┊⇇『تويتر』*
*🗃️┊⇇『جيبهاب』*
*🗄️┊⇇『جيبتهوب』*
*💌┊⇇『كابكات』*
*📤┊⇇『ميجا』*
*📥┊⇇『تطبيق』*
*📯┊⇇『انستا』*
*💎┊⇇『تيكتوك』*
*🛢️┊⇇『تيك-صوت』*
*⚙️┊⇇『تيك-جوده』*
*🖼️┊⇇『بين-صور』*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> إسِــــکْأّنِـوٌر بـــ𝑬𝑺𝑪𝑨𝑵𝑶𝑹ـــوت 💗💛
*⌝ قسم الصوتيات ┋💀⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
*🗿┊⇇『عميق』*
*⛓‍💥┊⇇『منفوخ』*
*🎐┊⇇『تخين』*
*⚽┊⇇『صاخب』*
*📿┊⇇『سريع』*
*📍┊⇇『تخينن』*
*🗃️┊⇇『رفيع』*
*📬┊⇇『تقطيع』*
*📕┊⇇『روبوت』*
*📆┊⇇『بطيء』*
*🗞️┊⇇『ناعم』*
*🐿️┊⇇『سنجاب』*
*🎙️┊⇇『tts2』*
*🗣️┊⇇『انطق』*
*🔊┊⇇『انطق2』*
*🎤┊⇇『انطق3』*
*🎚️┊⇇『تاثير』*
*📑┊⇇『تفاصيل-الأغنية』*
*🏆┊⇇『توبتيف』*
*🔁┊⇇『صوتكوبو』*
*🔇┊⇇『لصوت』*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> إسِــــکْأّنِـوٌر بـــ𝑬𝑺𝑪𝑨𝑵𝑶𝑹 𝑩𝑶𝑻ـــوت 💗💛
*⌝ قسم الادوات ┋🪄💀⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
🌐 *.كروم*  
⚠️ *.ابلاغ*  
🎵 *.اسم-الاغنية*  
📺 *.جوده*  
🎨 *.تحسين*  
🖌️ *.ارسم*  
🌤️ *.الطقس*  
📌 *.ايدي-جروب*  
🆔 *.ايدي*  
🏛️ *.بايدن*  
🎭 *.تاثير*  
🎤 *.تسجيل*  
📷 *.بروفايل*  
📏 *.مسافات*  
🖼️ *.ازالة-الخلفية*  
🔗 *.رابط*  
📊 *.الاحصائيات*  
🔗 *.لرابط2*  
🌍 *.دي-ان-اس*  
🗣️ *.انطق*  
🔤 *.ترجم*  
🌐 *.اي-بي*  
📌 *.توبتيف*  
📄 *.بي-دي-اف*  
🔗 *.لرابط1*  
🔗 *.لرابط2*  
🔗 *.لرابط3*  
🔊 *.لصوت*  
✂️ *.اختصر*  
🎨 *.واتستوك*  
🔄 *.تحريك-جانبي*  
🖼️ *.ازاله-الخلفيه2*  
⚠️ *.سبويلر*  
💬 *.تفاعل*  
📜 *.لباركود*  
📞 *.بحث-ارقام*  
🏷️ *.هيدر*  
📷 *.بروفايله*  
🔄 *.محول-الوسائط*  
🔑 *.كيوار*  
📩 *.بحث-رساله*  
👻 *.تخفي*  
🌍 *.فلسطين*  
📡 *.معلومات-القناه*  
🔍 *.فحص-الموقع*  
🥘 *.وصفه*  
🍳 *.طبخ*  
🔊 *.صوتكوبو*  
🗣️ *.انطق2*  
📑 *.نماذج*  
🗣️ *.انطق3*  
🔗 *.لرابط11*  
🔄 *.تبادل*  
🎭 *.جمال*  
🔗 *.لرابط12*  
🎭 *.ملصق*  
🎭 *.ملصق2*  
🎨 *.تحسين2*  
🎭 *.للللللملصق3*  
🎵 *.تفاصيل-الاغنيه*  
💰 *.عمله*  
🤖 *.تخيل*  
⚫ *.لاسود*  
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> 𝑬𝑺𝑪𝑨𝑵𝑶𝑹 𝑩𝑶𝑻💀
*⌝ قسم الدين ┋🕋⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
*🕋┊⇇『اذكاء-الصباح』*
*🕋┊⇇『اذكاء-المساء』*
*🕋┊⇇『اذكاء-النوم』*
*🕋┊⇇『دعاء』*
*🕋┊⇇『فيديو-قرأن』*
*🕋┊⇇『مواقيت_الصلاة』*
*🕋┊⇇『خطبة』*
*🕋┊⇇『دعاء-رمضان』*
*🕋┊⇇『الله』*
*🕋┊⇇『حديث』*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> إسِــــکْأّنِـوٌر بـــ𝑬𝑺𝑪𝑨𝑵𝑶𝑹ـــوت 💗💛
*⌝ قسم ┋🔍⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
*🔍┊⇇『IP』*
*🔍┊⇇『اخبار-انمي』*
*🔍┊⇇『اخبار-كره』*
*🔍┊⇇『بحث-تيك』*
*🔍┊⇇『دروس』*
*🔍┊⇇『فري-فاير』*
*🔍┊⇇『مانجا』*
*🔍┊⇇『ناسا』*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> إسِــــکْأّنِـوٌر بـــ𝑬𝑺𝑪𝑨𝑵𝑶𝑹ـــوت 💗💛
*⌝ قسم الذكاء ┋🧠⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
*🧠┊⇇『اوبو』*
*🧠┊⇇『اوبيتو』*
*🧠┊⇇『بلاك』*
*🧠┊⇇『بوت』*
*🧠┊⇇『ديبسيك』*
*🧠┊⇇『إسِــــکْأّنِـوٌر』*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> إسِــــکْأّنِـوٌر بـــ𝑬𝑺𝑪𝑨𝑵𝑶𝑹ـــوت 💗💛
> كوكب الأوامر العامة 💫
    `.trim();

    await conn.sendMessage(m.chat, { text: "*_جاري إرسال جميع الأوامر....... 💫📿_*" }, { quoted: m });

    await conn.sendMessage(m.chat, {
        image: { url: imageUrl },
        caption: messageText
    }, { quoted: m });

    await conn.sendMessage(m.chat, { react: { text: '💀', key: m.key } });
};

handler.command = /^جميع-الاوامر$/i;
handler.tags = ["اوبيتو"];
handler.help = ["اوبيتو"];

export default handler;