const handler = async (m, { conn }) => {

  const imageUrl = "https://i.postimg.cc/X7H7f51p/IMG.jpg";

  const messageText = `
*『 مرحبا بك يا ⌊ ${m.pushName} ⌉ في إسِــــکْأّنِـوٌر بــ𝑬𝑺𝑪𝑨𝑵𝑶𝑹ـــوت💀 』*

*⌝ قسم الادوات ┋🪄💀⌞ ⇊*
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
🌐 *.كروم*  
⚠️ *.ابلاغ*  
🎵 *.اسم-الاغنية*  
📺 *.جوده*  
🎨 *.تحسين*  
🖌️ *.ارسم*  
🌤️ *.الطقس*  
📌 *.ايدي-جروب*  
🆔 *.ايدي*  
🏛️ *.بايدن*  
🎭 *.تاثير*  
🎤 *.تسجيل*  
📷 *.بروفايل*  
📏 *.مسافات*  
🖼️ *.ازالة-الخلفية*  
🔗 *.رابط*  
📊 *.الاحصائيات*  
🔗 *.لرابط2*  
🌍 *.دي-ان-اس*  
🗣️ *.انطق*  
🔤 *.ترجم*  
🌐 *.اي-بي*  
📌 *.توبتيف*  
📄 *.بي-دي-اف*  
🔗 *.لرابط1*  
🔗 *.لرابط2*  
🔗 *.لرابط3*  
🔊 *.لصوت*  
✂️ *.اختصر*  
🎨 *.واتستوك*  
🔄 *.تحريك-جانبي*  
🖼️ *.ازاله-الخلفيه2*  
⚠️ *.سبويلر*  
💬 *.تفاعل*  
📜 *.لباركود*  
📞 *.بحث-ارقام*  
🏷️ *.هيدر*  
📷 *.بروفايله*  
🔄 *.محول-الوسائط*  
🔑 *.كيوار*  
📩 *.بحث-رساله*  
👻 *.تخفي*  
🌍 *.فلسطين*  
📡 *.معلومات-القناه*  
🔍 *.فحص-الموقع*  
🥘 *.وصفه*  
🍳 *.طبخ*  
🔊 *.صوتكوبو*  
🗣️ *.انطق2*  
📑 *.نماذج*  
🗣️ *.انطق3*  
🔗 *.لرابط11*  
🔄 *.تبادل*  
🎭 *.جمال*  
🔗 *.لرابط12*  
🎭 *.ملصق*  
🎭 *.ملصق2*  
🎨 *.تحسين2*  
🎭 *.للللللملصق3*  
🎵 *.تفاصيل-الاغنيه*  
💰 *.عمله*  
🤖 *.تخيل*  
⚫ *.لاسود*  
*⎔ ⋅ ───━ •﹝💀﹞• ━─── ⋅ ⎔*
> 𝑬𝑺𝑪𝑨𝑵𝑶𝑹
  `.trim();

  await conn.sendMessage(m.chat, { text: "*_جاري إرسال القسم....... 💗💀_*" }, { quoted: m });

  await conn.sendMessage(m.chat, {
    image: { url: imageUrl },
    caption: messageText
  }, { quoted: m });

  await conn.sendMessage(m.chat, { react: { text: '💀', key: m.key } });
};

handler.command = /^قسم-الادوات$/i;
handler.tags = ["اوبيتو"];
handler.help = ["قسم-الادوات"];

export default handler;