const handler = async (m, { conn }) => {
    const imageUrl = "https://i.postimg.cc/X7H7f51p/IMG.jpg";

    const messageText = `
╔═══❖•ೋ° °ೋ•❖═══╗  
 ✦『 مــرحــبــاً بــك يــا ⌊ ${m.pushName} ⌉ فــي 𝑯𝑬𝑳𝑴𝒀ـــوت 』✦  
╚═══❖•ೋ° °ೋ•❖═══╝  

✦━━━━━━━━━━━━━━✦  
      💀⌝ قــســم الــصــوتــيــات ⌞💀  
✦━━━━━━━━━━━━━━✦  

🗿 ⊰ عَـمـيــــق ⊱  
⛓‍💥 ⊰ مــنـفــــوخ ⊱  
🎐 ⊰ تــخــيــــن ⊱  
⚽ ⊰ صــاخــــب ⊱  
📿 ⊰ ســريــــع ⊱  
📍 ⊰ تـخـيــنـن ⊱  
🗃️ ⊰ رفــيــــع ⊱  
📬 ⊰ تـقـطـيــــع ⊱  
📕 ⊰ روبــــــوت ⊱  
📆 ⊰ بــــطــيء ⊱  
🗞️ ⊰ نــاعـــــم ⊱  
🐿️ ⊰ سـنـجــــاب ⊱  
🎙️ ⊰ 𝑻𝑻𝑺② ⊱  
🗣️ ⊰ أنــــطــق ⊱  
🔊 ⊰ أنــــطــق② ⊱  
🎤 ⊰ أنــــطــق③ ⊱  
🎚️ ⊰ تـأثــــيــر ⊱  
📑 ⊰ تـفــاصـيــــل-الأغـنـيــة ⊱  
🏆 ⊰ تـــــوبــتــيــف ⊱  
🔁 ⊰ صــوتـكــوبــــو ⊱  
🔇 ⊰ لــــصـــــوت ⊱  

✦━━━━━━━━━━━━━━✦  
     💗💛  𝑯𝑬𝑳𝑴𝒀 💛💗  
✦━━━━━━━━━━━━━━✦  
    `.trim();

    await conn.sendMessage(m.chat, {
        image: { url: imageUrl },
        caption: messageText
    }, { quoted: m });

    await conn.sendMessage(m.chat, { react: { text: '💀', key: m.key } });
};

handler.command = /^قسم-صوتيات$/i;
handler.tags = ["بـودي"];
handler.help = ["بـودي"];

export default handler;